izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/m202md28a.c
#include "m202md28a.h"
#include <math.h>
#include <stdarg.h>  /* va_start() va_end() va_arg() */
#include <Windows.h> /* MultiByteToWideChar() WideCharToMultiByte() */

/**
 * @brief  打开HID设备。
 * @param  vid Vendor ID。
 * @param  pid Product ID。
 * @return hid_device* HID设备，打开失败时返回NULL。
 */
hid_device* display_init(uint16_t vid, uint16_t pid)
{
    hid_device* device;

    device = hid_open(vid, pid, NULL);

    return device;
}

/**
 * @brief  关闭HID设备。
 * @param  device HID设备。
 */
void display_deinit(hid_device* device)
{
    if (device == NULL)
    {
        return;
    }

    hid_close(device);
    device = NULL;
}

/**
 * @brief  向屏幕发送数据。
 * @param  device HID设备。
 * @param  data 要发送的数据指针。
 * @param  data_size 要发送的数据大小。
 * @return 0=成功，-1=失败。
 */
int8_t display_send_data(hid_device* device, const uint8_t* data, uint16_t data_size)
{
    uint8_t usb_send_data[1 + 64]; /* 一位HID Report ID + HID单次允许发送的数据 */
    uint8_t allow_data_size;
    uint16_t loop_count;
    uint16_t i;

    if (device == NULL)
    {
        return -1;
    }

    allow_data_size = sizeof(usb_send_data) - 2; /* 屏幕一次可接受的纯数据大小，不包括最开始的一位数据大小位以及HID Report ID */
    loop_count = data_size / allow_data_size;    /* 发送全部数据所需循环次数 */

    for (i = 0; i < loop_count; i++) /* 如果要发送的数据比单次可接受的数据大，循环发送 */
    {
        memset(usb_send_data, 0x00, sizeof(usb_send_data));
        usb_send_data[0] = DISPLAY_HID_REPORT_ID;
        usb_send_data[1] = allow_data_size;
        memcpy(usb_send_data + 2, data, allow_data_size);
        data += allow_data_size;
        data_size -= allow_data_size;
        if (hid_write(device, usb_send_data, sizeof(usb_send_data)) < sizeof(usb_send_data))
        {
            return -1;
        }
    }

    if (data_size > 0) /* 发送剩余数据 */
    {
        memset(usb_send_data, 0x00, sizeof(usb_send_data));
        usb_send_data[0] = DISPLAY_HID_REPORT_ID;
        usb_send_data[1] = (uint8_t)data_size;
        memcpy(usb_send_data + 2, data, data_size);
        if (hid_write(device, usb_send_data, sizeof(usb_send_data)) < sizeof(usb_send_data))
        {
            return -1;
        }
    }

    return 0;
}

/**
 * @brief  向屏幕发送命令和参数。
 * @param  device HID设备。
 * @param  cmd 要发送的命令指针。
 * @param  cmd_size 要发送的命令大小。
 * @param  param_num 要发送的参数个数。
 * @param  ... 要发送的参数。
 * @return 0=成功，-1=失败。
 */
int8_t display_send_cmd(hid_device* device, const uint8_t* cmd, uint8_t cmd_size, uint8_t param_num, ...)
{
    uint8_t cmd_data[63];
    uint8_t cmd_data_size;
    uint16_t i;
    va_list valist;

    if (device == NULL)
    {
        return -1;
    }

    if (cmd_size + param_num > sizeof(cmd_data)) /* 限制命令和数据的大小不超过临时空间大小 */
    {
        return -1;
    }

    // memset(cmd_data, 0x00, sizeof(cmd_data));
    cmd_data_size = 0;

    memcpy(cmd_data + cmd_data_size, cmd, cmd_size); /* 填充命令 */
    cmd_data_size += cmd_size;

    va_start(valist, param_num);
    for (i = 0; i < param_num; i++) /* 填充参数 */
    {
        cmd_data[cmd_data_size] = (uint8_t)va_arg(valist, int);
        cmd_data_size += 1;
    }
    va_end(valist);

    if (display_send_data(device, cmd_data, cmd_data_size) != 0) /* 发送命令 */
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  读取命令执行状态。
 * @param  device HID设备。
 * @return 原始返回值。
 */
uint8_t display_read_state(hid_device* device)
{
    uint8_t usb_send_data[8];

    if (device == NULL)
    {
        return -1;
    }

    memset(usb_send_data, 0xFF, sizeof(usb_send_data));
    hid_read_timeout(device, usb_send_data, sizeof(usb_send_data), 5000); /* 超时时间5000毫秒 */

    return usb_send_data[4]; /* 返回数据 */
}

/**
 * @brief  加载屏幕默认设置。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_load_default_setting(hid_device* device)
{
    int8_t ret;

    if (device == NULL)
    {
        return -1;
    }

    ret = 0;
    ret += display_send_cmd(device, cmd_DisplayClear, sizeof(cmd_DisplayClear), 0);                                                    /* 清空显示 */
    ret += display_send_cmd(device, cmd_ReverseDisplay_P, sizeof(cmd_ReverseDisplay_P), 1, param_ReverseDisplay_Disable);              /* 关闭颜色反显 */
    ret += display_send_cmd(device, cmd_CursorDisplay_P, sizeof(cmd_CursorDisplay_P), 1, param_CursorDisplay_Disable);                 /* 关闭光标显示 */
    ret += display_send_cmd(device, cmd_OverWriteMode, sizeof(cmd_OverWriteMode), 0);                                                  /* 使用覆写模式 */
    ret += display_send_cmd(device, cmd_FROMUserFont_P, sizeof(cmd_FROMUserFont_P), 1, param_FROMUserFont_Disable);                    /* 不使用用户定义字体 */
    ret += display_send_cmd(device, cmd_InternationalFontSet_P, sizeof(cmd_InternationalFontSet_P), 1, 0x00);                          /* 国际字符设为默认 */
    ret += display_send_cmd(device, cmd_CharacterTableType_P, sizeof(cmd_CharacterTableType_P), 1, 0x00);                              /* 单字节字符表设为默认 */
    ret += display_send_cmd(device, cmd_2ByteCharacter_P, sizeof(cmd_2ByteCharacter_P), 1, param_2ByteCharacter_Disable);              /* 不使用双字节 */
    ret += display_send_cmd(device, cmd_BrightnessLevelSetting_P, sizeof(cmd_BrightnessLevelSetting_P), 1, param_BrightnessLevel_100); /* 亮度100% */
    ret += display_send_cmd(device, cmd_DisplayPower_P, sizeof(cmd_DisplayPower_P), 1, param_DisplayPower_Enable);                     /* 显示电源打开状态 */
    if (ret != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  清空已写入的用户字体和已保存的设置。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_reset_FROM(hid_device* device)
{
    if (device == NULL)
    {
        return -1;
    }

    display_send_cmd(device, cmd_InitializeDisplay, sizeof(cmd_InitializeDisplay), 0); /* 初始化显示，初始化完成后用户字体将暂时不可用，其他所有设置从FROM内读取 */

    display_load_default_setting(device); /* 加载默认设置 */

    display_send_cmd(device, cmd_UserSetUpModeStart, sizeof(cmd_UserSetUpModeStart), 0); /* 进入用户设置模式 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

    display_send_cmd(device, cmd_UserFontDeletAll, sizeof(cmd_UserFontDeletAll), 0); /* 删除全部用户字体 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

