izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/m202md28a.c
    display_send_cmd(device, cmd_UserTableDeletAll, sizeof(cmd_UserTableDeletAll), 0); /* 删除全部字体表 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

    display_send_cmd(device, cmd_UserSetUpModeEnd, sizeof(cmd_UserSetUpModeEnd), 0); /* 退出用户设置模式，屏幕自动保存设置并重新启动 */

    return 0;
}

/**
 * @brief  写入用户字体。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_write_FROM(hid_device* device)
{
    uint8_t from_data[3846];
    uint8_t* from_data_ptr;

    if (device == NULL)
    {
        return -1;
    }

    display_send_cmd(device, cmd_InitializeDisplay, sizeof(cmd_InitializeDisplay), 0); /* 初始化显示，初始化完成后用户字体将暂时不可用，其他所有设置从FROM内读取 */

    display_load_default_setting(device); /* 加载默认设置，防止后面保存了错误的初始设置 */

    display_send_cmd(device, cmd_UserSetUpModeStart, sizeof(cmd_UserSetUpModeStart), 0); /* 进入用户设置模式 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

    display_send_cmd(device, cmd_UserFontDeletAll, sizeof(cmd_UserFontDeletAll), 0); /* 删除全部用户字体 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

    display_send_cmd(device, cmd_UserTableDeletAll, sizeof(cmd_UserTableDeletAll), 0); /* 删除全部字体表 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

    from_data_ptr = from_data;
    memset(from_data_ptr, 0xFF, sizeof(from_data));

    memcpy(from_data_ptr, cmd_UserTableRegistAll, sizeof(cmd_UserTableRegistAll)); /* 填充写入字体表命令 */
    from_data_ptr += sizeof(cmd_UserTableRegistAll);

    /* 因为字体表需要一次设置全部，所以预先整理 */
    /* 填充播放图标数据 */
    memcpy(from_data_ptr, FROM_icon_stop, sizeof(FROM_icon_stop)); /* 0x80 */
    from_data_ptr += sizeof(FROM_icon_stop);
    memcpy(from_data_ptr, FROM_icon_play, sizeof(FROM_icon_play)); /* 0x81 */
    from_data_ptr += sizeof(FROM_icon_play);
    memcpy(from_data_ptr, FROM_icon_pause, sizeof(FROM_icon_pause)); /* 0x82 */
    from_data_ptr += sizeof(FROM_icon_pause);
    memcpy(from_data_ptr, FROM_icon_load, sizeof(FROM_icon_load)); /* 0x83 */
    from_data_ptr += sizeof(FROM_icon_load);

    /* 填充频谱图标数据 */
    from_data_ptr += 12 * (15 * 16 / 8);
    memcpy(from_data_ptr, FROM_icon_bar, sizeof(FROM_icon_bar)); /* 0x90 ~ 0x9F */
    from_data_ptr += sizeof(FROM_icon_bar);

    display_send_data(device, from_data, sizeof(from_data)); /* 发送字体表数据 */
    if (display_read_state(device) != 0x00)
    {
        return -1;
    }

    display_send_cmd(device, cmd_UserSetUpModeEnd, sizeof(cmd_UserSetUpModeEnd), 0); /* 退出用户设置模式，屏幕自动保存设置并重新启动 */

    return 0;
}

/**
 * @brief  设置亮度。
 * @param  device HID设备。
 * @param  level 亮度等级，0 ~ 3
 * @return 0=成功，-1=失败。
 */
int8_t display_set_dim(hid_device* device, uint8_t level)
{
    if (device == NULL)
    {
        return -1;
    }

    if (level > 3)
    {
        level = 3;
    }

    if (display_send_cmd(device, cmd_BrightnessLevelSetting_P, sizeof(cmd_BrightnessLevelSetting_P), 1, level + 1) != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  设置电源。
 * @param  device HID设备。
 * @param  power 电源开关，0=关闭，1=打开
 * @return 0=成功，-1=失败。
 */
int8_t display_set_power(hid_device* device, uint8_t power)
{
    if (device == NULL)
    {
        return -1;
    }

    if (power > 1)
    {
        power = 1;
    }

    if (display_send_cmd(device, cmd_DisplayPower_P, sizeof(cmd_DisplayPower_P), 1, power) != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  清空屏幕显示。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_clear_screen(hid_device* device)
{
    if (device == NULL)
    {
        return -1;
    }

    if (display_send_cmd(device, cmd_DisplayClear, sizeof(cmd_DisplayClear), 0) != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  清空一行显示，清空后光标回到该行最左侧。
 * @param  device HID设备。
 * @param  line 要清除的行号，从0开始
 * @return 0=成功，-1=失败。
 */
int8_t display_clear_line(hid_device* device, uint8_t line)
{
    int8_t ret;

    if (device == NULL)
    {
        return -1;
    }

    ret = 0;
    ret += display_send_cmd(device, cmd_CursorSet_2P, sizeof(cmd_CursorSet_2P), 2, 1, line + 1);
    ret += display_send_cmd(device, cmd_LineClear, sizeof(cmd_LineClear), 0);
    if (ret != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  设置代码页为双字节。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_set_cp_utf8(hid_device* device)
{
    int8_t ret;

    if (device == NULL)
    {
        return -1;
    }

    ret = 0;
    ret += display_send_cmd(device, cmd_2ByteCharacter_P, sizeof(cmd_2ByteCharacter_P), 1, param_2ByteCharacter_Enable);
    ret += display_send_cmd(device, cmd_CharacterTableType_P, sizeof(cmd_CharacterTableType_P), 1, 0x00);
    if (ret != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  设置代码页为单字节ASCII。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_set_cp_ascii(hid_device* device)
{
    int8_t ret;

    if (device == NULL)
    {
        return -1;
    }

    ret = 0;
    ret += display_send_cmd(device, cmd_2ByteCharacter_P, sizeof(cmd_2ByteCharacter_P), 1, param_2ByteCharacter_Disable);
    ret += display_send_cmd(device, cmd_CharacterTableType_P, sizeof(cmd_CharacterTableType_P), 1, 0x00);
    if (ret != 0)
    {
        return -1;
    }

    return 0;
}

/**
 * @brief  设置代码页为单字节用户字体。
 * @param  device HID设备。
 * @return 0=成功，-1=失败。
 */
int8_t display_set_cp_user(hid_device* device)
{
    int8_t ret;

    if (device == NULL)
    {
        return -1;
    }

    ret = 0;
    ret += display_send_cmd(device, cmd_2ByteCharacter_P, sizeof(cmd_2ByteCharacter_P), 1, param_2ByteCharacter_Disable);
    ret += display_send_cmd(device, cmd_CharacterTableType_P, sizeof(cmd_CharacterTableType_P), 1, 0xFF);
    if (ret != 0)
    {
        return -1;
    }

    return 0;
}

static int8_t search_codepage(const uint16_t* codepage, uint32_t codepage_size, uint8_t codepage_id, uint16_t unicode, uint16_t* oem_code)
{
    uint32_t i;

    codepage_size /= sizeof(uint16_t);
    for (i = 0; i < codepage_size; i += 2)
    {
        if (codepage[i] == unicode)
        {
            oem_code[0] = codepage_id;
            oem_code[1] = codepage[i + 1];
            return 0;
        }
    }

    return -1;
}

static void in_gb2312_range(uint16_t* oem_code)
{
    if (!((oem_code[1] >> 8) >= 0xA1 && (oem_code[1] >> 8) <= 0xFE && (oem_code[1] & 0x00FF) >= 0xA1 && (oem_code[1] & 0x00FF) <= 0xFE))
    {
        oem_code[0] = 0;
        oem_code[1] = 0x0000;
    }
}

/**
 * @brief  绘制UTF8字符串。
 * @param  device HID设备。
 * @param  x 显示起始X位置，从0开始。
 * @param  y 显示起始Y位置，从0开始。
 * @param  str_start_pos 要显示的字符起始位置，从0开始。
 * @param  str_draw_count 要显示的字符长度，从1开始，如果大于40或小于0则使用默认值40，为0没有任何显示。
 * @param  fill 当要绘制的字符小于指定数量时，是否使用指定字符进行填充
 * @param  str 要显示的字符串指针，必须存在结束符'\0'。
 * @return 0=成功，-1=失败。
 */
int8_t display_draw_utf8(hid_device* device, uint8_t x, uint8_t y, uint8_t str_start_pos, uint8_t str_draw_count, char fill, const char* str)
{
    int32_t i;
    uint16_t* unicode_str;
    int32_t unicode_str_len;
    uint16_t oem_code[2];     /* [0]存储字符内码码表类型，[1]存储字符内码 */
    uint8_t display_data[63]; /* 一次最多处理的数据量，达到后发送数据到屏幕，可增大或减小 */
    uint8_t* display_data_ptr;
    uint16_t display_data_size;
    uint8_t current_codepage;
    uint8_t fill_str_len;
    uint8_t max_singledata_size;

