izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/m202md28a.c
    if (device == NULL)
    {
        return -1;
    }

    if (*str == '\0') /* 不处理以结束符开头的字符串 */
    {
        return 0;
    }

    unicode_str_len = MultiByteToWideChar(CP_UTF8, 0, str, -1, NULL, 0); /* 获取全部UTF8字符数量，第四个参数为-1时结束符'\0'会被计算 */
    if (unicode_str_len < 0)
    {
        return -1;
    }

    unicode_str_len -= 1; /* 减去结束符，方便后面计算 */

    fill_str_len = 0;
    if (fill != '\0' && unicode_str_len - str_start_pos < str_draw_count) /* 要填充的字符不为结束符，且待显示的字符数小于设置的最大字符数 */
    {
        if (unicode_str_len - str_start_pos <= 0) /* 没有待显示字符被发送，全部显示填充字符 */
        {
            fill_str_len = str_draw_count;
            str_start_pos = 0;
        }
        else /* 将剩余空间填充为指定字符 */
        {
            fill_str_len = str_draw_count - unicode_str_len - str_start_pos;
        }
    }

    unicode_str = (uint16_t*)malloc((unicode_str_len + fill_str_len + 1) * sizeof(uint16_t)); /* 分配UNICODE字符串和填充字符空间 */
    if (unicode_str == NULL)
    {
        return -1;
    }

    MultiByteToWideChar(CP_UTF8, 0, str, -1, unicode_str, unicode_str_len + 1); /* UTF8转UNICODE字符串，第四个参数为-1时结束符'\0'会被复制，无需手动添加 */

    // memset(display_data, 0x00, sizeof(display_data));
    display_data_ptr = display_data;
    display_data_size = 0;

    memcpy(display_data_ptr, cmd_CursorSet_2P, sizeof(cmd_CursorSet_2P)); /* 复制设置光标位置指令 */
    display_data_ptr += sizeof(cmd_CursorSet_2P);
    display_data_size += sizeof(cmd_CursorSet_2P);
    *display_data_ptr = x + 1; /* 设置光标位置X数据，从1开始 */
    display_data_ptr += 1;
    display_data_size += 1;
    *display_data_ptr = y + 1; /* 设置光标位置Y数据，从1开始 */
    display_data_ptr += 1;
    display_data_size += 1;

    if (str_start_pos < 0)
    {
        str_start_pos = 0;
    }
    if (str_draw_count < 0 || str_draw_count > 40)
    {
        str_draw_count = 40;
    }

    if (fill_str_len > 0) /* 填充要填充的字符 */
    {
        for (i = 0; i < fill_str_len; i++)
        {
            unicode_str[unicode_str_len + i] = fill;
        }
        unicode_str[unicode_str_len + fill_str_len] = '\0';
        unicode_str_len += fill_str_len;
    }

    /* 确定单次循环所需的最大数据大小 */
    max_singledata_size = sizeof(cmd_2ByteCharacter_P) + 1 + 2;
    max_singledata_size = max(max_singledata_size + (sizeof(cmd_CharacterTableType_P) + 1), max_singledata_size + (sizeof(cmd_2ByteCharacterType_P) + 1));

    current_codepage = 0;
    for (i = 0; i < unicode_str_len; i++) /* 因为屏幕的中日韩代码页是分开的，所以需要确认每个字符并切换到相应的代码页 */
    {
        if (i < str_start_pos || i >= (str_start_pos + str_draw_count)) /* 限制显示起始字符和最大显示长度 */
        {
            continue;
        }
        if (display_data_size > (sizeof(display_data) - max_singledata_size) || display_data_size == 0) /* 待发送的数据超出单次允许填充的大小，发送一次数据。 */
        {
            if (display_data_size != 0)
            {
                if (display_send_data(device, display_data, display_data_size) != 0) /* 如果每个字符都切换代码页，那么显示一屏要发四次数据。 */
                {
                    free(unicode_str);
                    return -1;
                }
            }
            // memset(display_data, 0x00, sizeof(display_data)); /* 初始化待发送数据 */
            display_data_ptr = display_data;
            display_data_size = 0;
        }
        oem_code[0] = 0;
        oem_code[1] = 0x0000;
        if (unicode_str[i] < 0x007F) /* ASCII字符 */
        {
            oem_code[0] = 5;
            oem_code[1] = unicode_str[i];
        }
        if (oem_code[0] == 0 && unicode_str[i] >= 0x0080 && unicode_str[i] <= 0x00FF) /* 扩展ASCII字符 */
        {
            oem_code[0] = 6;
            oem_code[1] = unicode_str[i];
        }
        /* 需要注意，中文代码页里虽然有日文字符，但是字体样式和日语代码页内的不同，所以搜索顺序会在一定范影响显示效果，可以自行替换 SHIFTJIS日语 和 GB2312简体中文 的位置来查看差异 */
        if (oem_code[0] == 0) /* GB2312简体中文 */
        {
            search_codepage(uni2oem936, sizeof(uni2oem936), 3, unicode_str[i], oem_code);
            in_gb2312_range(oem_code); /* 936码表范围是GBK，限制到屏幕支持的GB2312范围 */
        }
        if (oem_code[0] == 0) /* BIG5繁体中文 */
        {
            search_codepage(uni2oem950, sizeof(uni2oem950), 4, unicode_str[i], oem_code);
        }
        if (oem_code[0] == 0) /* SHIFTJIS日语 */
        {
            search_codepage(uni2oem932, sizeof(uni2oem932), 1, unicode_str[i], oem_code);
        }
        if (oem_code[0] == 0) /* KSC5601韩语 */
        {
            search_codepage(uni2oem949, sizeof(uni2oem949), 2, unicode_str[i], oem_code);
        }
        if (oem_code[0] != 0)
        {
            if ((oem_code[0] != current_codepage)) /*需要切换代码页 */
            {
                if (oem_code[0] <= 5) /* 当前字符为双字节字符或标准ASCII */
                {
                    if (current_codepage == 6 || current_codepage == 0) /* 上一次的代码页为扩展ASCII或未设置，双字节已关闭，需要先打开双字节 */
                    {
                        memcpy(display_data_ptr, cmd_2ByteCharacter_P, sizeof(cmd_2ByteCharacter_P));
                        display_data_ptr += sizeof(cmd_2ByteCharacter_P);
                        *display_data_ptr = param_2ByteCharacter_Enable;
                        display_data_ptr += 1;
                        display_data_size += sizeof(cmd_2ByteCharacter_P) + 1;
                    }
                    if (oem_code[0] <= 4) /* 当前字符是双字节字符 */
                    {
                        memcpy(display_data_ptr, cmd_2ByteCharacterType_P, sizeof(cmd_2ByteCharacterType_P));
                        display_data_ptr += sizeof(cmd_2ByteCharacterType_P);
                        *display_data_ptr = oem_code[0] - 1; /* 程序判断所使用的代码页范围为1 ~ 4（5、6表示ASCII，不在此处理），屏幕使用的代码页范围为0 ~ 3，进行匹配。 */
                        display_data_ptr += 1;
                        display_data_size += sizeof(cmd_2ByteCharacterType_P) + 1;
                    }
                }
                else /* 当前字符为扩展ASCII */
                {
                    /* 关闭双字节 */
                    memcpy(display_data_ptr, cmd_2ByteCharacter_P, sizeof(cmd_2ByteCharacter_P));
                    display_data_ptr += sizeof(cmd_2ByteCharacter_P);
                    *display_data_ptr = param_2ByteCharacter_Disable;
                    display_data_ptr += 1;
                    display_data_size += sizeof(cmd_2ByteCharacter_P) + 1;

                    /* 切换到 WPC1252 */
                    memcpy(display_data_ptr, cmd_CharacterTableType_P, sizeof(cmd_CharacterTableType_P));
                    display_data_ptr += sizeof(cmd_CharacterTableType_P);
                    *display_data_ptr = 0x10; /* WPC1252 */
                    display_data_ptr += 1;
                    display_data_size += sizeof(cmd_CharacterTableType_P) + 1;
                }
            }
            current_codepage = oem_code[0] & 0x00FF;
            switch (oem_code[0]) /* 复制单个字符 */
            {
            case 1: /* 双字节 */
            case 2:
            case 3:
            case 4:
                display_data_size += 2;
                *display_data_ptr = oem_code[1] >> 8;
                display_data_ptr += 1;
                *display_data_ptr = oem_code[1] & 0x00FF;
                display_data_ptr += 1;
                break;
            case 5: /* 标准ASCII */
            case 6: /* 扩展ASCII */
                if (oem_code[1] != 0x0000)
                {
                    display_data_size += 1;
                    *display_data_ptr = oem_code[1] & 0x00FF;
                    display_data_ptr += 1;
                }
                break;
            }
        }
        else /* 不支持的编码，如特殊符号等，使用特定ASCII字符填充 */
        {
            display_data_size += 1;
            *display_data_ptr = '?';
            display_data_ptr += 1;
        }
    }
    free(unicode_str);
    if (display_data_size != 0) /* 最后一次发送剩余的数据。 */
    {
        if (display_send_data(device, display_data, display_data_size) != 0)
        {
            return -1;
        }
    }

