izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/m202md28a.c
    return 0;
}

/**
 * @brief  绘制ASCII字符串，可用于显示用户字体。
 * @param  device HID设备。
 * @param  x 显示起始X位置，从0开始。
 * @param  y 显示起始Y位置，从0开始。
 * @param  str_start_pos 要显示的字符起始位置，从0开始。
 * @param  str_draw_count 要显示的字符长度，从1开始，如果大于40或小于0则使用默认值40，为0没有任何显示。
 * @param  fill 当要绘制的字符小于指定数量时，是否使用指定字符进行填充
 * @param  str 要显示的字符串指针，必须存在结束符'\0'。
 * @return 0=成功，-1=失败。
 */
int8_t display_draw_ascii(hid_device* device, uint8_t x, uint8_t y, uint8_t str_start_pos, uint8_t str_draw_count, char fill, const char* str)
{
    int32_t i;
    int32_t str_len;
    uint8_t display_data[44]; /* 因为ASCII单个字符只需要一个字节即可，所以设置为大于等于一屏要发送的数据 */
    uint8_t* display_data_ptr;
    uint16_t display_data_size;
    uint8_t fill_str_len;

    if (device == NULL)
    {
        return -1;
    }

    if (*str == '\0') /* 不处理以结束符开头的字符串 */
    {
        return 0;
    }

    str_len = strlen(str); /* 获取全部字符数量，不包括结束符'\0' */
    if (str_len <= 0)
    {
        return 0;
    }

    // memset(display_data, 0x00, sizeof(display_data));
    display_data_ptr = display_data;
    display_data_size = 0;

    memcpy(display_data_ptr, cmd_CursorSet_2P, sizeof(cmd_CursorSet_2P)); /* 填充设置光标位置指令 */
    display_data_ptr += sizeof(cmd_CursorSet_2P);
    display_data_size += sizeof(cmd_CursorSet_2P);

    *display_data_ptr = x + 1; /* 设置光标位置X数据，从1开始 */
    display_data_ptr += 1;
    display_data_size += 1;

    *display_data_ptr = y + 1; /* 设置光标位置Y数据，从1开始 */
    display_data_ptr += 1;
    display_data_size += 1;

    if (str_start_pos < 0)
    {
        str_start_pos = 0;
    }
    if (str_draw_count < 0 || str_draw_count > 40)
    {
        str_draw_count = 40;
    }

    fill_str_len = 0;
    if (fill != '\0' && str_len - str_start_pos < str_draw_count)
    {
        if (str_len - str_start_pos <= 0)
        {
            fill_str_len = str_draw_count;
            str_start_pos = 0;
        }
        else
        {
            fill_str_len = str_draw_count - (str_len - str_start_pos);
        }
    }

    for (i = 0; i < str_len + fill_str_len; i++) /* 填充待显示字符 */
    {
        if (i < str_start_pos || i >= (str_start_pos + str_draw_count)) /* 限制显示起始字符和最大显示长度 */
        {
            continue;
        }
        if (display_data_size < sizeof(display_data))
        {
            if (i < str_len)
            {
                *display_data_ptr = str[i];
            }
            else
            {
                *display_data_ptr = fill;
            }
            display_data_size += 1;
            display_data_ptr += 1;
        }
        else
        {
            break;
        }
    }
    if (display_data_size != 0) /* 发送显示数据。 */
    {
        if (display_send_data(device, display_data, display_data_size) != 0)
        {
            return -1;
        }
    }

    return 0;
}

void scroll_unicode_left(uint16_t* unicode_src, uint32_t unicode_src_len, uint16_t* unicode_dst, uint32_t unicode_dst_len, uint32_t scroll_len)
{
    uint32_t i;
    uint32_t unicode_str_pos;

    unicode_str_pos = scroll_len % unicode_src_len;

    for (i = 0; i < unicode_dst_len; i++)
    {
        unicode_dst[i] = *(unicode_src + unicode_str_pos);
        unicode_str_pos += 1;
        if (unicode_str_pos >= unicode_src_len)
        {
            unicode_str_pos = 0;
        }
    }
}

void scroll_unicode_right(uint16_t* unicode_src, uint32_t unicode_src_len, uint16_t* unicode_dst, uint32_t unicode_dst_len, uint32_t scroll)
{
    uint32_t i;

    for (i = 0; i < unicode_dst_len; i++)
    {
        if (i >= scroll)
        {
            if (unicode_src_len >= 1)
            {
                *unicode_dst = *unicode_src;
                unicode_src += 1;
                unicode_dst += 1;
                unicode_src_len -= 1;
            }
            else
            {
                break;
            }
        }
        else
        {
            *unicode_dst = ' ';
            unicode_dst += 1;
        }
    }
}

/**
 * @brief  滚动UTF8字符串。
 * @param  src_str 原UTF8字符串。
 * @param  move_len 滚动长度，为正向右滚动，为负向左滚动。
 * @param  display_line_len 可显示的字符型长度。
 * @param  dist_str 滚动完成后的UTF8字符串。
 * @param  dist_str_max_size 滚动完成后的UTF8字符串最大内存大小。
 */
void display_scroll_utf8(const char* src_str, int16_t move_len, uint8_t display_line_len, char* dist_str, uint16_t dist_str_max_size)
{
    uint16_t* unicode_str_src;
    uint16_t* unicode_str_dist;
    int32_t unicode_str_len;

    unicode_str_len = MultiByteToWideChar(CP_UTF8, 0, src_str, -1, NULL, 0); /* 获取全部UTF8字符数量，第四个参数为-1时结束符'\0'会被计算 */
    if (unicode_str_len < 0)
    {
        return;
    }
    unicode_str_src = (uint16_t*)malloc(unicode_str_len * sizeof(uint16_t));       /* 分配UNICODE字符串空间 */
    unicode_str_dist = (uint16_t*)malloc((display_line_len + 1) * sizeof(uint16_t)); /* 分配UNICODE字符串空间 */
    if (unicode_str_src == NULL || unicode_str_dist == NULL)
    {
        return;
    }
    memset(unicode_str_dist, '\0', (display_line_len + 1) * sizeof(uint16_t));
    MultiByteToWideChar(CP_UTF8, 0, src_str, -1, unicode_str_src, unicode_str_len); /* UTF8转UNICODE字符串，第四个参数为-1时结束符'\0'会被复制，无需手动添加 */

    unicode_str_len -= 1;

    if (move_len < 0)
    {
        scroll_unicode_left(unicode_str_src, unicode_str_len, unicode_str_dist, display_line_len, -move_len);
    }
    else
    {
        scroll_unicode_right(unicode_str_src, unicode_str_len, unicode_str_dist, display_line_len, move_len);
    }

    WideCharToMultiByte(CP_UTF8, 0, unicode_str_dist, -1, dist_str, dist_str_max_size, NULL, NULL);

    free(unicode_str_src);
    free(unicode_str_dist);
}

/**
 * @brief  获取UTF8字符串长度，可选忽略结尾的指定ASCII字符。
 * @param  src_str UTF8字符串。
 * @param  ignore 要忽略的结尾ASCII字符，传入结束符则不忽略。
 * @return 字符串长度，不包括结束符'\0'。
 */
uint32_t display_get_utf8_len(const char* src_str, char ignore)
{
    int32_t i;
    uint16_t* unicode_str;
    int32_t unicode_str_len;

    unicode_str_len = MultiByteToWideChar(CP_UTF8, 0, src_str, -1, NULL, 0); /* 获取全部UTF8字符数量，第四个参数为-1时结束符'\0'会被计算 */
    if (unicode_str_len < 0)
    {
        return 0;
    }
    unicode_str = (uint16_t*)malloc(unicode_str_len * sizeof(uint16_t)); /* 分配UNICODE字符串空间 */
    if (unicode_str == NULL)
    {
        return 0;
    }
    MultiByteToWideChar(CP_UTF8, 0, src_str, -1, unicode_str, unicode_str_len); /* UTF8转UNICODE字符串，第四个参数为-1时结束符'\0'会被复制，无需手动添加 */

    for (i = unicode_str_len - 1; i > 0; i--)
    {
        if (ignore != '\0')
        {
            if (unicode_str[i] == ignore || unicode_str[i] == '\0')
            {
                unicode_str_len -= 1;
            }
            else
            {
                break;
            }
        }
        else
        {
            unicode_str_len -= 1;
            break;
        }
    }
    free(unicode_str);

    return (uint32_t)unicode_str_len;
}
